const products = [
    {
        "code": "A007",
        "fact": "โรงงานเอ",
        "name": "น้ำปลาแท้ม้า",
        "unt": "ขวด"
    },
    {
        "code": "A001",
        "fact": "โรงงานเอ",
        "name": "ปลากระป๋องโรซ่า",
        "unt": "แพ็ค"
    },
    {
        "code": "A002",
        "fact": "โรงงานเอ",
        "name": "น้ำปลาแท้",
        "unt": "ขวด"
    },
    {
        "code": "A003",
        "fact": "โรงงานเอ",
        "name": "ผงชูรส",
        "unt": "ซอง"
    },
    {
        "code": "A004",
        "fact": "โรงงานเอ",
        "name": "ผงชูรส2",
        "unt": "ซอง"
    },
    {
        "code": "A005",
        "fact": "โรงงานเอ",
        "name": "ผงชูรส3",
        "unt": "ซอง"
    },
    {
        "code": "A006",
        "fact": "โรงงานเอ",
        "name": "ผงชูรส4",
        "unt": "ซอง"
    },
    {
        "code": "B101",
        "fact": "โรงงานบี",
        "name": "ข้าวหอมมะลิ",
        "unt": "ถุง"
    },
    {
        "code": "C202",
        "fact": "โรงงานซี",
        "name": "สบู่อาบน้ำ",
        "unt": "ก้อน"
    }
];